In [ ]:
import pandas as pd

In [ ]:
df = pd.read_spss("Basefinal.sav")

In [ ]:
column_headers = list(df.columns.values)
print("The Column Header :", column_headers)

The Column Header : ['nt', 'dia', 'mes', 'ciudad', 'sexo', 'edad', 'edadan', 'EDADX', 'EDADG', 'p3', 'P3G', 'p4', 'P4G', 'p5', 'p6', 'P6X', 'p7', 'P7X', 'P7ME15', 'P7ME15X', 'p8', 'p9', 'p10', 'P10X', 'P10Y', 'p11', 'P11X', 'P11Y', 'P11Z', 'p12', 'p12a', 'p13a', 'p13b', 'P13', 'P13X', 'P13Y', 'p14', 'p10p15', 'p15', 'P15X', 'P15Y', 'p16', 'P16X', 'P16Y', 'P16Z', 'p17', 'p17a', 'p18a', 'p18b', 'P18', 'P18X', 'P18Y', 'p19a', 'p19b', 'P19', 'P19X', 'P19Y', 'p20a', 'p20b', 'p20c', 'p21', 'p15p22', 'p22', 'P22X', 'P22Y', 'p23', 'P23X', 'P23Y', 'P23Z', 'p24', 'p24a', 'p25', 'P25X', 'P25Y', 'p26', 'p27', 'P27X', 'P27Y', 'p28', 'p29a', 'p29b', 'p29c', 'p29d', 'p29e', 'p29f', 'P29AX', 'P29BX', 'P29CX', 'P29DX', 'P29EX', 'P29FX', 'P29SUM', 'P29SUMX', 'p30', 'P30WP', 'p30a', 'P30AX', 'P30AY', 'p31a', 'p31b', 'p31c', 'p31d', 'p31e', 'p31f', 'p31g', 'p31h', 'p31i', 'p31j', 'p31k', 'p31l', 'p31m', 'p31n', 'P31AY', 'P31BY', 'P31CY', 'P31DY', 'P31EY', 'P31FY', 'P31GY', 'P31HY', 'P31IY', 'P31JY', 'P31KY', 'p32', 'p32a', 'p33', 'p34', 'p35', 'p36a', 'p36b', 'p36c', 'p37', 'p37bs', 'p37t', 'p38', 'p39', 'p40a1', 'p40a2', 'p40b1', 'p40b2', 'p40c1', 'p40c2', 'p40d1', 'p40d2', 'p40e1', 'p40e2', 'p40f1', 'p40f2', 'P40A1Y', 'P40B1Y', 'P40C1Y', 'P40D2Y', 'P40E2Y', 'P40F2Y', 'P40A2Y', 'P40B2Y', 'P40C2Y', 'p41', 'p42', 'P42X', 'P42Y', 'p43a', 'p43b', 'p43c', 'p43d', 'p43e', 'P43AY', 'P43BY', 'P43CY', 'P43DY', 'P43EY', 'p43f', 'p43g', 'p43h', 'p44', 'p45a', 'p45b', 'P45AY', 'P45BY', 'p45c', 'p45d', 'p45e', 'p46', 'p46p52', 'p47', 'P47X', 'p48', 'p49', 'p50', 'P50X', 'P50Y', 'p51', 'p52', 'p53a', 'p53b', 'p53c', 'p54', 'p55a', 'p55b', 'p55c', 'p56', 'p57a1', 'P57A1X', 'P57A1Y', 'p58a1', 'P58A1X', 'P58A1Y', 'p58b1', 'P58B1X', 'P58B1Y', 'p57a2', 'P57A2X', 'P57A2Y', 'P57A3', 'P57A3X', 'P57A3Y', 'p58a2', 'P58A2X', 'P58A2Y', 'p58b2', 'P58B2X', 'P58B2Y', 'p59', 'p60a1', 'P60A1X', 'P60A1Y', 'p60a2', 'P60A2X', 'P60A2Y', 'P60A3', 'P60A3X', 'P60A3Y', 'p61', 'p62', 'p63', 'p64', 'p64a', 'p65', 'P65X', 'p66a', 'P66AX', 'P66AY', 'p66b', 'P66BX', 'P66BY', 'p67a', 'p67b', 'P67', 'P67X', 'P67Y', 'GASTOS', 'ING_NETO', 'ING_BRUTO_C', 'ING_NETO_C', 'p68', 'P68X', 'P68Y', 'P68MES', 'P68MESX', 'P68MESY', 'p69a', 'P69AX', 'P69AY', 'p69b', 'P69BX', 'P69BY', 'p70', 'p71', 'p71a', 'p71b', 'p72m1lu1', 'p72m1lu2', 'p72m1lu3', 'p72m1lu4', 'p72m1lu5', 'p72m1ma1', 'p72m1ma2', 'p72m1ma3', 'p72m1ma4', 'p72m1ma5', 'p72m1mi1', 'p72m1mi2', 'p72m1mi3', 'p72m1mi4', 'p72m1mi5', 'p72m1ju1', 'p72m1ju2', 'p72m1ju3', 'p72m1ju4', 'p72m1ju5', 'p72m1vi1', 'p72m1vi2', 'p72m1vi3', 'p72m1vi4', 'p72m1vi5', 'p72m1sa1', 'p72m1sa2', 'p72m1sa3', 'p72m1sa4', 'p72m1sa5', 'p72m1do1', 'p72m1do2', 'p72m1do3', 'p72m1do4', 'p72m1do5', 'P72M1LUH', 'P72M1MAH', 'P72M1MIH', 'P72M1JUH', 'P72M1VIH', 'P72M1SAH', 'P72M1DOH', 'p72m2lu1', 'p72m2lu2', 'p72m2lu3', 'p72m2lu4', 'p72m2lu5', 'p72m2ma1', 'p72m2ma2', 'p72m2ma3', 'p72m2ma4', 'p72m2ma5', 'p72m2mi1', 'p72m2mi2', 'p72m2mi3', 'p72m2mi4', 'p72m2mi5', 'p72m2ju1', 'p72m2ju2', 'p72m2ju3', 'p72m2ju4', 'p72m2ju5', 'p72m2vi1', 'p72m2vi2', 'p72m2vi3', 'p72m2vi4', 'p72m2vi5', 'p72m2sa1', 'p72m2sa2', 'p72m2sa3', 'p72m2sa4', 'p72m2sa5', 'p72m2do1', 'p72m2do2', 'p72m2do3', 'p72m2do4', 'p72m2do5', 'P72M2LUH', 'P72M2MAH', 'P72M2MIH', 'P72M2JUH', 'P72M2VIH', 'P72M2SAH', 'P72M2DOH', 'p72m3lu1', 'p72m3lu2', 'p72m3lu3', 'p72m3lu4', 'p72m3lu5', 'p72m3ma1', 'p72m3ma2', 'p72m3ma3', 'p72m3ma4', 'p72m3ma5', 'p72m3mi1', 'p72m3mi2', 'p72m3mi3', 'p72m3mi4', 'p72m3mi5', 'p72m3ju1', 'p72m3ju2', 'p72m3ju3', 'p72m3ju4', 'p72m3ju5', 'p72m3vi1', 'p72m3vi2', 'p72m3vi3', 'p72m3vi4', 'p72m3vi5', 'p72m3sa1', 'p72m3sa2', 'p72m3sa3', 'p72m3sa4', 'p72m3sa5', 'p72m3do1', 'p72m3do2', 'p72m3do3', 'p72m3do4', 'p72m3do5', 'P72M3LUH', 'P72M3MAH', 'P72M3MIH', 'P72M3JUH', 'P72M3VIH', 'P72M3SAH', 'P72M3DOH', 'P72LU', 'P72LUX', 'P72LUY', 'P72MA', 'P72MAX', 'P72MAY', 'P72MI', 'P72MIX', 'P72MIY', 'P72JU', 'P72JUX', 'P72JUY', 'P72VI', 'P72VIX', 'P72VIY', 'P72SA', 'P72SAX', 'P72SAY', 'P72DO', 'P72DOX', 'P72DOY', 'P72HRS', 'P72HRSX', 'P72HRSY', 'p76a', 'P76AX', 'P76AY', 'P76AG', 'p76b', 'P76BX', 'P76BY', 'P76BG', 'p76c', 'P76CX', 'P76CY', 'P76CG', 'p77', 'p78a', 'p78b', 'p78c', 'p78d', 'p79', 'P79X', 'P79Y', 'p79km', 'P79KMX', 'p80', 'p80a', 'P80AX', 'P80AY', 'p80b', 'P80BX', 'P80BY', 'p82a', 'P82AY', 'p82b', 'P82BY', 'p82c', 'P82CY', 'p82d', 'P82DY', 'p82e', 'P82EY', 'p82f', 'P82FY', 'p82g', 'P82GY', 'p82h', 'p82i', 'p82j', 'p85a', 'P85AX', 'P85AY', 'P85AG', 'p85b', 'P85BX', 'P85BY', 'P85BG', 'p86a', 'P86AY', 'p86b', 'P86BY', 'p86c', 'P86CY', 'p86d', 'P86DY', 'p86e', 'p86f', 'p86g', 'p87', 'p88', 'p89a', 'p89b', 'p89c', 'p90', 'p90a', 'P90AY', 'p90b', 'P90BY', 'p90c', 'P90CY', 'p90d', 'P90DY', 'p91', 'p91a', 'P91AY', 'p91b', 'P91BY', 'p91c', 'P91CY', 'p91d', 'P91DY', 'p92a', 'P92AY', 'p92b', 'P92BY', 'p92c', 'P92CY', 'p92d', 'P92DY', 'p93', 'p94a', 'P94AY', 'p94b', 'P94BY', 'p94d', 'P94DY', 'p94c', 'P94CY', 'p95', 'p96', 'p97a', 'p97b', 'p97c', 'p98a1', 'p98a2', 'P98A2X', 'p98a3', 'p98b1', 'p98b2', 'P98B2X', 'P98B2DIA', 'P98B2SEM', 'P98B2FIN', 'P98B2MES', 'P98B2DIAG', 'P98B2SEMG', 'p98b3', 'p98c', 'p99a', 'P99AY', 'p99b', 'P99BY', 'p99c', 'P99CY', 'p99d', 'p100', 'p101a', 'P101AY', 'P101AG', 'p101b', 'P101BY', 'P101BG', 'p101c', 'P101CY', 'P101CG', 'p102a', 'P102AY', 'P102AG', 'p102b', 'P102BG', 'P102BY', 'p102c', 'P102CY', 'P102CG', 'p103', 'p104', 'p105', 'p106a', 'p106b', 'p106c', 'p107a', 'p107b', 'p107c', 'p107d', 'p107e', 'p108', 'p108a', 'P108AG', 'p108b', 'P108BG', 'p108c', 'P108CG', 'p109', 'p110', 'p110a', 'P110AG', 'p110b', 'P110BG', 'p110c', 'P110CG', 'p111a', 'P111AG', 'p111b', 'P111BG', 'p111c', 'P111CG', 'p112a', 'p112b', 'p112c', 'p112d', 'p112e', 'p112f', 'p112g', 'da1a', 'da1b', 'da1c', 'xnt', 'WPESO', 'obs1', 'obs2', 'obs3', 'obs4', 'obs5', 'obs6', 'obs7', 'obs8', 'obs9', 'obs10', 'EMPR', 'LU0', 'LU1', 'LU2', 'LU3', 'LU4', 'LU5', 'LU6', 'LU7', 'LU8', 'LU9', 'LU10', 'LU11', 'LU12', 'LU13', 'LU14', 'LU15', 'LU16', 'LU17', 'LU18', 'LU19', 'LU20', 'LU21', 'LU22', 'LU23', 'P72M1LUHx', 'P72M2LUHx', 'P72M3LUHx', 'MA0', 'MA1', 'MA2', 'MA3', 'MA4', 'MA5', 'MA6', 'MA7', 'MA8', 'MA9', 'MA10', 'MA11', 'MA12', 'MA13', 'MA14', 'MA15', 'MA16', 'MA17', 'MA18', 'MA19', 'MA20', 'MA21', 'MA22', 'MA23', 'P72M1MAHx', 'P72M2MAHx', 'P72M3MAHx', 'MI0', 'MI1', 'MI2', 'MI3', 'MI4', 'MI5', 'MI6', 'MI7', 'MI8', 'MI9', 'MI10', 'MI11', 'MI12', 'MI13', 'MI14', 'MI15', 'MI16', 'MI17', 'MI18', 'MI19', 'MI20', 'MI21', 'MI22', 'MI23', 'P72M1MIHx', 'P72M2MIHx', 'P72M3MIHx', 'JU0', 'JU1', 'JU2', 'JU3', 'JU4', 'JU5', 'JU6', 'JU7', 'JU8', 'JU9', 'JU10', 'JU11', 'JU12', 'JU13', 'JU14', 'JU15', 'JU16', 'JU17', 'JU18', 'JU19', 'JU20', 'JU21', 'JU22', 'JU23', 'P72M1JUHx', 'P72M2JUHx', 'P72M3JUHx', 'VI0', 'VI1', 'VI2', 'VI3', 'VI4', 'VI5', 'VI6', 'VI7', 'VI8', 'VI9', 'VI10', 'VI11', 'VI12', 'VI13', 'VI14', 'VI15', 'VI16', 'VI17', 'VI18', 'VI19', 'VI20', 'VI21', 'VI22', 'VI23', 'P72M1VIHx', 'P72M2VIHx', 'P72M3VIHx', 'SA0', 'SA1', 'SA2', 'SA3', 'SA4', 'SA5', 'SA6', 'SA7', 'SA8', 'SA9', 'SA10', 'SA11', 'SA12', 'SA13', 'SA14', 'SA15', 'SA16', 'SA17', 'SA18', 'SA19', 'SA20', 'SA21', 'SA22', 'SA23', 'P72M1SAHx', 'P72M2SAHx', 'P72M3SAHx', 'DO0', 'DO1', 'DO2', 'DO3', 'DO4', 'DO5', 'DO6', 'DO7', 'DO8', 'DO9', 'DO10', 'DO11', 'DO12', 'DO13', 'DO14', 'DO15', 'DO16', 'DO17', 'DO18', 'DO19', 'DO20', 'DO21', 'DO22', 'DO23', 'P72M1DOHx', 'P72M2DOHx', 'P72M3DOHx', 'P72LU2', 'P72MA2', 'P72MI2', 'P72JU2', 'P72VI2', 'P72SA2', 'P72DO2', 'P72NDIAS', 'P72NDIASX', 'P72INILU', 'P72INIMA', 'P72INIMI', 'P72INIJU', 'P72INIVI', 'P72INISA', 'P72INIDO', 'P72PEDLU', 'P72PEDMA', 'P72PEDMI', 'P72PEDJU', 'P72PEDVI', 'P72PEDSA', 'P72PEDDO', 'P72PED', 'P72PEDLUX', 'P72PEDLUY', 'P72PEDMAX', 'P72PEDMAY', 'P72PEDMIX', 'P72PEDMIY', 'P72PEDJUX', 'P72PEDJUY', 'P72PEDVIX', 'P72PEDVIY', 'P72PEDSAX', 'P72PEDSAY', 'P72PEDDOX', 'P72PEDDOY', 'P72PEDX', 'P72PEDY', 'INGPED', 'EDUCACION', 'ANTERIOR', 'RAZONES', 'PLURIACT', 'ANTIGUEDAD', 'ACTIVIDAD_AGRE', 'JEFE']

In [ ]:
df['dependencia'] = df['p65'].astype(int)

In [ ]:
def d(dependencia):
    if dependencia == 0:
        return 'Nadie'
    if dependencia == 1 or dependencia == 2:
        return 'Hasta dos' 
    else:
        return 'Mas de dos'

In [ ]:
df['dependencia'] = df['dependencia'].apply(d)

In [ ]:
df1 = df[['edad']]

In [ ]:
dfn1 = df['p60a1']

In [ ]:
df['p60a1'].dtypes

CategoricalDtype(categories=[  350.0,   500.0,   600.0,   640.0,   700.0,   800.0,
                    850.0,   900.0,  1000.0,  1100.0,
                  ...
                   8000.0,  8032.0,  8200.0,  8400.0,  8800.0,  9000.0,
                  10000.0, 10500.0, 12000.0, 'Ns/Nr'],
, ordered=False)

In [ ]:
df['p67b']

0            Mes
1            Mes
2            Mes
3      Trimestre
4            NaN
         ...
547          Mes
548     Quincena
549          Mes
550          Mes
551    Trimestre
Name: p67b, Length: 552, dtype: category
Categories (5, object): ['Mes', 'Quincena', 'Semana', 'Semestre', 'Trimestre']

In [ ]:
df['p67b'] = df['p67b'].fillna('Mes')

In [ ]:
def f(p67b):
    if p67b == 'Semana':
        return 4
    if p67b == 'Quincena':
        return 2
    if p67b == 'Mes':
        return 1
    if p67b == 'Trimestre':
        return 0.33 
    else:
        return 0.17

In [ ]:
df['periodo'] = df['p67b'].apply(f)

In [ ]:
df['periodo'] = df['periodo'].astype(int)

In [ ]:
df['p67a'] = df['p67a'].astype(int)

In [ ]:
df['mantenimiento'] = df['p67a'] * df['periodo']

In [ ]:
df['p66a'] = df['p66a'].astype(int)

In [ ]:
df['p66b'] = df['p66b'].astype(int)

In [ ]:
df['gastos'] = df['mantenimiento'] + df['p66a'] + df['p66b']

In [ ]:
def x(p60a1):
    if p60a1 == 'Ns/Nr':
        return 2000
    else:
        return p60a1

In [ ]:
df['ingresom'] = df['p60a1'].apply(x)

In [ ]:
df['ingresor'] = df['ingresom'] - df['gastos']

In [ ]:
df['categoria'] = df['ingresor'].apply(lambda x: 'minimo' if x < 2370 else 'medio' if x < 4740 else 'alto')

In [ ]:
df['categoria'].value_counts()

minimo    238
medio     218
alto       96
Name: categoria, dtype: int64

In [ ]:
def years_of_study(p4):
    if p4 == 'Ninguno' or p4 == 'Primaria completa' or p4 == 'Secundaria incompleta' or p4 == 'Secundaria completa':
        return 'Secundario'
    else:
        return 'Alto'

In [ ]:
df['years of study'] = df['p4'].apply(years_of_study)

In [ ]:
df.rename(columns={'years of study':'educacion'}, inplace=True)

In [ ]:
df['educacion'].value_counts()

Alto          365
Secundario    187
Name: educacion, dtype: int64

In [ ]:
def jefe(p8):
    if p8 == 'Jefe o jefa del hogar':
        return 'jefe'
    else:
        return 'no jefe'

In [ ]:
df['jefe'] = df['p8'].apply(jefe)

In [ ]:
df['jefe'].value_counts()

no jefe    282
jefe       190
Name: jefe, dtype: int64

In [ ]:
df['anterior'] = df['p12']

In [ ]:
def asalariado(anterior):
    if anterior ==  'Empleado' or anterior == 'Obrero' or anterior == 'Profesional independiente/ Consultor':
        return 'asalariado'
    else:
        return 'no asalariado'

In [ ]:
df['anterior'] = df['anterior'].apply(asalariado)

In [ ]:
df['anterior'].value_counts()

asalariado       463
no asalariado     66
Name: anterior, dtype: int64

In [ ]:
df['antiguedad'] = df['p27']

In [ ]:
def anti(antiguedad):
    if antiguedad <=  12:
        return 1
    if antiguedad <= 24:
        return 2
    if antiguedad <= 33:
        return 3
    else:
        return 4

In [ ]:
df['antiguedad'] = df['antiguedad'].apply(anti)

In [ ]:
df['antiguedad'].value_counts()

1    198
2    175
4    107
3     72
Name: antiguedad, dtype: int64

In [ ]:
df['pluriactividad'] = df['p21']

In [ ]:
def m(pluriactividad):
    if pluriactividad == 'Solo trabaja como delivery':
        return 'Solo trabaja como delivery'
    else:
        return 'Alterna con otro trabajo y/o estudios'

In [ ]:
df['pluriactividad'] = df['pluriactividad'].apply(m)

In [ ]:
df['razones'] = df['p14']

In [ ]:
df['razones']

0                     Razones económicas/ bajos ingresos
1                La empresa, negocio, actividad se cerró
2      Características del trabajo (aburrido, malos h...
3                                          Fue despedido
4      Características del trabajo (aburrido, malos h...
                             ...
547              La empresa, negocio, actividad se cerró
548                                        Fue despedido
549                                   Razones personales
550                                        Fue despedido
551                                                  NaN
Name: razones, Length: 552, dtype: category
Categories (11, object): ['Cambiaron las políticas de la empresa', 'Características del trabajo (aburrido, malos ..., 'Era un empleo temporal', 'Fue despedido', ..., 'Por falta de capital o de clientes', 'Razones económicas/ bajos ingresos', 'Razones personales', 'Sigue realizando el mismo trabajo']

In [ ]:
def z(razones):
    if razones == 'Era un empleo temporal':
        return 'Era un empleo temporal'
    if razones == 'Fue despedido' or razones == 'La empresa, negocio, actividad se cerró' or razones == 'Por falta de capital o de clientes' or razones =='Fue obligado a renunciar':
        return 'Razones de la demanda'
    if razones == 'Razones personales':
        return 'Razones personales'
    if razones == 'Razones económicas/ bajos ingresos':
        return 'Razones económicas/ bajos ingresos'
    else:
        return 'Renuncio'

In [ ]:
df['razones'] = df['razones'].apply(z)

In [ ]:
df['p7']

C:\Users\INSTALACION\AppData\Local\anaconda3\Lib\site-packages\IPython\lib\pretty.py:778: FutureWarning: Index.ravel returning ndarray is deprecated; in a future version this will return a view on self.
  output = repr(obj)

0      0.0
1      0.0
2      2.0
3      0.0
4      0.0
      ...
547    0.0
548    NaN
549    NaN
550    0.0
551    1.0
Name: p7, Length: 552, dtype: category
Categories (8, float64): [0.0, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0]

In [ ]:
df['p7'] = df['p7'].fillna(0)

In [ ]:
df['menores'] = df['p7'].astype(int)

In [ ]:
df['menores'].value_counts()

0    275
1    155
2     78
3     30
4      9
5      3
6      1
7      1
Name: menores, dtype: int64

In [ ]:
def t(menores):
    if menores == 0:
        return 'ninguno'
    else:
        return 'menores en el hogar'

In [ ]:
df['menores'] = df['menores'].apply(t)

In [ ]:
df2 = df[['edad', 'razones','pluriactividad', 'antiguedad', 'ingresor', 'categoria', 'educacion', 'jefe','anterior','menores','dependencia']]

In [ ]:
df2

,edad,razones,pluriactividad,antiguedad,ingresor,categoria,educacion,jefe,anterior,menores,dependencia
0,22.0,Razones económicas/ bajos ingresos,Alterna con otro trabajo y/o estudios,1,1517.0,minimo,Alto,jefe,asalariado,ninguno,Hasta dos
1,25.0,Razones de la demanda,Alterna con otro trabajo y/o estudios,4,4100.0,medio,Alto,no jefe,asalariado,ninguno,Nadie
2,24.0,Renuncio,Solo trabaja como delivery,3,3890.0,medio,Secundario,jefe,asalariado,menores en el hogar,Mas de dos
3,27.0,Razones de la demanda,Alterna con otro trabajo y/o estudios,3,3300.0,medio,Alto,no jefe,asalariado,ninguno,Nadie
4,27.0,Renuncio,Alterna con otro trabajo y/o estudios,4,3750.0,medio,Alto,no jefe,asalariado,ninguno,Nadie
...,...,...,...,...,...,...,...,...,...,...,...
547,28.0,Razones de la demanda,Alterna con otro trabajo y/o estudios,4,2095.0,minimo,Alto,jefe,asalariado,ninguno,Hasta dos
548,22.0,Razones de la demanda,Solo trabaja como delivery,1,1740.0,minimo,Secundario,NaN,asalariado,ninguno,Nadie
549,20.0,Razones personales,Alterna con otro trabajo y/o estudios,2,1765.0,minimo,Alto,NaN,asalariado,ninguno,Nadie
550,37.0,Razones de la demanda,Solo trabaja como delivery,1,3338.0,medio,Alto,jefe,asalariado,ninguno,Hasta dos
551,30.0,NaN,Alterna con otro trabajo y/o estudios,4,3190.0,medio,Alto,jefe,NaN,menores en el hogar,Hasta dos

In [ ]:
df2['edad'] = df2['edad'].astype(int)

C:\Users\INSTALACION\AppData\Local\Temp\ipykernel_16572\806111492.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['edad'] = df2['edad'].astype(int)

In [ ]:
df2['edad'].dtypes

dtype('int32')

In [ ]:
df2_e = df2[df2['edad'].between(18, 24)]
df2_e1 = df2[df2['edad'].between(25,29)]
df2_ee = df2[df2['edad'] > 29]

In [ ]:
df2_e['edad'].value_counts()

22    47
23    44
24    40
21    24
20    19
19    13
18     5
Name: edad, dtype: int64

In [ ]:
df2_e1['edad'].value_counts()

26    52
28    44
27    41
25    37
29    37
Name: edad, dtype: int64

In [ ]:
df2_ee['edad'].value_counts()

30    29
32    20
33    17
31    16
35    15
34    15
37     8
36     8
40     3
38     3
44     3
50     2
43     2
46     2
41     2
42     1
45     1
47     1
39     1
Name: edad, dtype: int64

In [ ]:
df2_e

,edad,razones,pluriactividad,antiguedad,ingresor,categoria,educacion,jefe,anterior,menores,dependencia
0,22,Razones económicas/ bajos ingresos,Alterna con otro trabajo y/o estudios,1,1517.0,minimo,Alto,jefe,asalariado,ninguno,Hasta dos
2,24,Renuncio,Solo trabaja como delivery,3,3890.0,medio,Secundario,jefe,asalariado,menores en el hogar,Mas de dos
10,23,Razones personales,Alterna con otro trabajo y/o estudios,3,2810.0,medio,Alto,no jefe,asalariado,menores en el hogar,Nadie
12,23,Razones económicas/ bajos ingresos,Alterna con otro trabajo y/o estudios,2,2305.0,minimo,Alto,no jefe,asalariado,menores en el hogar,Hasta dos
13,20,Razones económicas/ bajos ingresos,Solo trabaja como delivery,1,4735.0,medio,Alto,no jefe,asalariado,menores en el hogar,Nadie
...,...,...,...,...,...,...,...,...,...,...,...
540,24,Razones económicas/ bajos ingresos,Solo trabaja como delivery,1,2400.0,medio,Secundario,NaN,asalariado,ninguno,Nadie
541,24,Razones personales,Solo trabaja como delivery,4,7074.0,alto,Alto,jefe,asalariado,ninguno,Hasta dos
543,23,Razones personales,Solo trabaja como delivery,2,2220.0,minimo,Alto,NaN,asalariado,ninguno,Nadie
548,22,Razones de la demanda,Solo trabaja como delivery,1,1740.0,minimo,Secundario,NaN,asalariado,ninguno,Nadie
549,20,Razones personales,Alterna con otro trabajo y/o estudios,2,1765.0,minimo,Alto,NaN,asalariado,ninguno,Nadie

In [ ]:
df2_ee

,edad,razones,pluriactividad,antiguedad,ingresor,categoria,educacion,jefe,anterior,menores,dependencia
6,32,Razones personales,Alterna con otro trabajo y/o estudios,1,2165.0,minimo,Secundario,no jefe,asalariado,ninguno,Hasta dos
16,37,Razones de la demanda,Alterna con otro trabajo y/o estudios,3,2250.0,minimo,Alto,jefe,asalariado,menores en el hogar,Hasta dos
17,31,Razones de la demanda,Solo trabaja como delivery,4,5835.0,alto,Alto,NaN,asalariado,ninguno,Nadie
23,33,Razones personales,Alterna con otro trabajo y/o estudios,2,1700.0,minimo,Alto,no jefe,asalariado,ninguno,Nadie
32,33,Razones de la demanda,Solo trabaja como delivery,1,3117.0,medio,Alto,NaN,asalariado,ninguno,Nadie
...,...,...,...,...,...,...,...,...,...,...,...
539,36,Razones de la demanda,Solo trabaja como delivery,1,5030.0,alto,Alto,no jefe,asalariado,ninguno,Hasta dos
542,31,Razones de la demanda,Alterna con otro trabajo y/o estudios,4,2884.0,medio,Secundario,jefe,asalariado,menores en el hogar,Mas de dos
546,30,Razones económicas/ bajos ingresos,Solo trabaja como delivery,1,3190.0,medio,Secundario,jefe,no asalariado,ninguno,Nadie
550,37,Razones de la demanda,Solo trabaja como delivery,1,3338.0,medio,Alto,jefe,asalariado,ninguno,Hasta dos
551,30,NaN,Alterna con otro trabajo y/o estudios,4,3190.0,medio,Alto,jefe,NaN,menores en el hogar,Hasta dos

In [ ]:
pd.crosstab(df2.educacion, df2.categoria)

categoria   alto  medio  minimo
educacion
Alto          54    150     161
Secundario    42     68      77

In [ ]:
pd.crosstab(df2.educacion, df2.pluriactividad)

pluriactividad,Alterna con otro trabajo y/o estudios,Solo trabaja como delivery
educacion,,
Alto,258,107
Secundario,70,117

In [ ]:
pd.crosstab(df2.educacion, df2.razones)

razones,Era un empleo temporal,Razones de la demanda,Razones económicas/ bajos ingresos,Razones personales,Renuncio
educacion,,,,,
Alto,30,94,71,104,48
Secundario,17,48,51,40,26

In [ ]:
pd.crosstab(df2.educacion, df2.antiguedad)

antiguedad    1    2   3   4
educacion
Alto        129  118  49  69
Secundario   69   57  23  38

In [ ]:
pd.crosstab(df2.educacion, df2.jefe)

jefe        jefe  no jefe
educacion
Alto         115      196
Secundario    75       86

In [ ]:
pd.crosstab(df2.educacion, df2.anterior)

anterior    asalariado  no asalariado
educacion
Alto               307             40
Secundario         156             26

In [ ]:
pd.crosstab(df2.jefe, df2.categoria)

categoria  alto  medio  minimo
jefe
jefe         39     85      66
no jefe      38    104     140

In [ ]:
pd.crosstab(df2.jefe, df2.pluriactividad)

pluriactividad,Alterna con otro trabajo y/o estudios,Solo trabaja como delivery
jefe,,
jefe,85,105
no jefe,196,86

In [ ]:
pd.crosstab(df2.jefe, df2.razones)

razones,Era un empleo temporal,Razones de la demanda,Razones económicas/ bajos ingresos,Razones personales,Renuncio
jefe,,,,,
jefe,15,57,49,42,25
no jefe,21,62,63,82,36

In [ ]:
pd.crosstab(df2.jefe, df2.antiguedad)

antiguedad    1   2   3   4
jefe
jefe         64  54  22  50
no jefe     107  98  40  37

In [ ]:
pd.crosstab(df2.jefe, df2.educacion)

educacion  Alto  Secundario
jefe
jefe        115          75
no jefe     196          86

In [ ]:
pd.crosstab(df2.jefe, df2.anterior)

anterior  asalariado  no asalariado
jefe
jefe             170             18
no jefe          227             37

In [ ]:
pd.crosstab(df2.anterior, df2.categoria)

categoria      alto  medio  minimo
anterior
asalariado       71    192     200
no asalariado    19     19      28

In [ ]:
pd.crosstab(df2.anterior, df2.pluriactividad)

pluriactividad,Alterna con otro trabajo y/o estudios,Solo trabaja como delivery
anterior,,
asalariado,272,191
no asalariado,39,27

In [ ]:
pd.crosstab(df2.anterior, df2.razones)

razones,Era un empleo temporal,Razones de la demanda,Razones económicas/ bajos ingresos,Razones personales,Renuncio
anterior,,,,,
asalariado,44,109,111,132,67
no asalariado,3,33,11,12,7

In [ ]:
pd.crosstab(df2.anterior, df2.antiguedad)

antiguedad       1    2   3   4
anterior
asalariado     162  155  61  85
no asalariado   28   14   9  15

In [ ]:
pd.crosstab(df2.anterior, df2.educacion)

educacion      Alto  Secundario
anterior
asalariado      307         156
no asalariado    40          26

In [ ]:
pd.crosstab(df2.anterior, df2.jefe)

jefe           jefe  no jefe
anterior
asalariado      170      227
no asalariado    18       37

In [ ]:
def a(edad):
    if edad == 18 or edad == 19 or edad == 20 or edad == 21 or edad == 22 or edad == 23 or edad == 24 or edad == 25 or edad == 26 or edad == 27 or edad == 28 or edad == 29:
        return 'edad entre 18-29'
    else:
        return 'mayores de 30'

In [ ]:
#def f(edad):
    #if edad > 18 and edad < 29:
        #return 'edad entre 18-29'
    #else:
        return 'mayores de 30'

In [ ]:
df2['edad'] = df2['edad'].apply(a)

C:\Users\INSTALACION\AppData\Local\Temp\ipykernel_16572\1001020082.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['edad'] = df2['edad'].apply(a)

In [ ]:
pd.crosstab(df2.edad, df2.categoria)

categoria         alto  medio  minimo
edad
edad entre 18-29    64    161     178
mayores de 30       32     57      60

In [ ]:
pd.crosstab(df2.edad, df2.pluriactividad)

pluriactividad,Alterna con otro trabajo y/o estudios,Solo trabaja como delivery
edad,,
edad entre 18-29,250,153
mayores de 30,78,71

In [ ]:
pd.crosstab(df2.edad, df2.razones)

razones,Era un empleo temporal,Razones de la demanda,Razones económicas/ bajos ingresos,Razones personales,Renuncio
edad,,,,,
edad entre 18-29,34,80,100,112,55
mayores de 30,13,62,22,32,19

In [ ]:
pd.crosstab(df2.edad, df2.antiguedad)

antiguedad          1    2   3   4
edad
edad entre 18-29  151  139  51  62
mayores de 30      47   36  21  45

In [ ]:
pd.crosstab(df2.edad, df2.educacion)

educacion         Alto  Secundario
edad
edad entre 18-29   258         145
mayores de 30      107          42

In [ ]:
pd.crosstab(df2.edad, df2.jefe)

jefe              jefe  no jefe
edad
edad entre 18-29   117      236
mayores de 30       73       46

In [ ]:
pd.crosstab(df2.edad, df2.anterior)

anterior          asalariado  no asalariado
edad
edad entre 18-29         339             42
mayores de 30            124             24

In [ ]:
pd.crosstab(df2.anterior, df2.edad)

edad           edad entre 18-29  mayores de 30
anterior
asalariado                  339            124
no asalariado                42             24

In [ ]:
pd.crosstab(df2.educacion, df2.edad)

edad        edad entre 18-29  mayores de 30
educacion
Alto                     258            107
Secundario               145             42

In [ ]:
pd.crosstab(df2.jefe, df2.edad)

edad     edad entre 18-29  mayores de 30
jefe
jefe                  117             73
no jefe               236             46

In [ ]:
df2

,edad,razones,pluriactividad,antiguedad,ingresor,categoria,educacion,jefe,anterior,menores,dependencia
0,edad entre 18-29,Razones económicas/ bajos ingresos,Alterna con otro trabajo y/o estudios,1,1517.0,minimo,Alto,jefe,asalariado,ninguno,Hasta dos
1,edad entre 18-29,Razones de la demanda,Alterna con otro trabajo y/o estudios,4,4100.0,medio,Alto,no jefe,asalariado,ninguno,Nadie
2,edad entre 18-29,Renuncio,Solo trabaja como delivery,3,3890.0,medio,Secundario,jefe,asalariado,menores en el hogar,Mas de dos
3,edad entre 18-29,Razones de la demanda,Alterna con otro trabajo y/o estudios,3,3300.0,medio,Alto,no jefe,asalariado,ninguno,Nadie
4,edad entre 18-29,Renuncio,Alterna con otro trabajo y/o estudios,4,3750.0,medio,Alto,no jefe,asalariado,ninguno,Nadie
...,...,...,...,...,...,...,...,...,...,...,...
547,edad entre 18-29,Razones de la demanda,Alterna con otro trabajo y/o estudios,4,2095.0,minimo,Alto,jefe,asalariado,ninguno,Hasta dos
548,edad entre 18-29,Razones de la demanda,Solo trabaja como delivery,1,1740.0,minimo,Secundario,NaN,asalariado,ninguno,Nadie
549,edad entre 18-29,Razones personales,Alterna con otro trabajo y/o estudios,2,1765.0,minimo,Alto,NaN,asalariado,ninguno,Nadie
550,mayores de 30,Razones de la demanda,Solo trabaja como delivery,1,3338.0,medio,Alto,jefe,asalariado,ninguno,Hasta dos
551,mayores de 30,NaN,Alterna con otro trabajo y/o estudios,4,3190.0,medio,Alto,jefe,NaN,menores en el hogar,Hasta dos

In [ ]:
pd.crosstab(df2.edad, df2.categoria)

categoria         alto  medio  minimo
edad
edad entre 18-29    64    161     178
mayores de 30       32     57      60

In [ ]:
pd.crosstab(df2.edad, df2.pluriactividad)

pluriactividad,Alterna con otro trabajo y/o estudios,Solo trabaja como delivery
edad,,
edad entre 18-29,250,153
mayores de 30,78,71

In [ ]:
pd.crosstab(df2.edad, df2.razones)

razones,Era un empleo temporal,Razones de la demanda,Razones económicas/ bajos ingresos,Razones personales,Renuncio
edad,,,,,
edad entre 18-29,34,80,100,112,55
mayores de 30,13,62,22,32,19

In [ ]:
pd.crosstab(df2.edad, df2.antiguedad)

antiguedad          1    2   3   4
edad
edad entre 18-29  151  139  51  62
mayores de 30      47   36  21  45

In [ ]:
pd.crosstab(df2.edad, df2.educacion)

educacion         Alto  Secundario
edad
edad entre 18-29   258         145
mayores de 30      107          42

In [ ]:
pd.crosstab(df2.edad, df2.jefe)

jefe              jefe  no jefe
edad
edad entre 18-29   117      236
mayores de 30       73       46

In [ ]:
pd.crosstab(df2.edad, df2.anterior)

anterior          asalariado  no asalariado
edad
edad entre 18-29         339             42
mayores de 30            124             24

In [ ]:
pd.crosstab(df2.anterior, df2.edad)

edad           edad entre 18-29  mayores de 30
anterior
asalariado                  339            124
no asalariado                42             24

In [ ]:
pd.crosstab(df2.educacion, df2.edad)

edad        edad entre 18-29  mayores de 30
educacion
Alto                     258            107
Secundario               145             42

In [ ]:
pd.crosstab(df2.jefe, df2.edad)

edad     edad entre 18-29  mayores de 30
jefe
jefe                  117             73
no jefe               236             46

In [ ]:
pd.crosstab(df2.menores, df2.categoria)

categoria            alto  medio  minimo
menores
menores en el hogar    51    113     113
ninguno                45    105     125

In [ ]:
pd.crosstab(df2.menores, df2.pluriactividad)

pluriactividad,Alterna con otro trabajo y/o estudios,Solo trabaja como delivery
menores,,
menores en el hogar,153,124
ninguno,175,100

In [ ]:
pd.crosstab(df2.menores, df2.anterior)

anterior             asalariado  no asalariado
menores
menores en el hogar         240             28
ninguno                     223             38

In [ ]:
pd.crosstab(df2.menores, df2.educacion)

educacion            Alto  Secundario
menores
menores en el hogar   171         106
ninguno               194          81

In [ ]:
pd.crosstab(df2.menores, df2.jefe)

jefe                 jefe  no jefe
menores
menores en el hogar   136      141
ninguno                54      141

In [ ]:
pd.crosstab(df2.menores, df2.razones)

razones,Era un empleo temporal,Razones de la demanda,Razones económicas/ bajos ingresos,Razones personales,Renuncio
menores,,,,,
menores en el hogar,22,73,67,67,39
ninguno,25,69,55,77,35

In [ ]:
pd.crosstab(df2.menores, df2.edad)

edad                 edad entre 18-29  mayores de 30
menores
menores en el hogar               201             76
ninguno                           202             73

In [ ]:
pd.crosstab(df2.menores, df2.antiguedad)

antiguedad             1   2   3   4
menores
menores en el hogar  103  82  38  54
ninguno               95  93  34  53

In [ ]:
pd.crosstab(df2.dependencia, df2.categoria)

categoria    alto  medio  minimo
dependencia
Hasta dos      37     97      99
Mas de dos     26     49      30
Nadie          33     72     109

In [ ]:
pd.crosstab(df2.dependencia, df2.edad)

edad         edad entre 18-29  mayores de 30
dependencia
Hasta dos                 174             59
Mas de dos                 59             46
Nadie                     170             44

In [ ]:
pd.crosstab(df2.dependencia, df2.categoria)

categoria    alto  medio  minimo
dependencia
Hasta dos      37     97      99
Mas de dos     26     49      30
Nadie          33     72     109

In [ ]:
pd.crosstab(df2.dependencia, df2.pluriactividad)

pluriactividad,Alterna con otro trabajo y/o estudios,Solo trabaja como delivery
dependencia,,
Hasta dos,130,103
Mas de dos,47,58
Nadie,151,63

In [ ]:
pd.crosstab(df2.dependencia, df2.anterior)

anterior     asalariado  no asalariado
dependencia
Hasta dos           203             22
Mas de dos           88             15
Nadie               172             29

In [ ]:
pd.crosstab(df2.dependencia, df2.antiguedad)

antiguedad    1   2   3   4
dependencia
Hasta dos    89  76  28  40
Mas de dos   30  30  18  27
Nadie        79  69  26  40

In [ ]:
pd.crosstab(df2.dependencia, df2.educacion)

educacion    Alto  Secundario
dependencia
Hasta dos     151          82
Mas de dos     65          40
Nadie         149          65

In [ ]:
pd.crosstab(df2.dependencia, df2.jefe)

jefe         jefe  no jefe
dependencia
Hasta dos     117      104
Mas de dos     60       42
Nadie          13      136

In [ ]:
pd.crosstab(df2.dependencia, df2.razones)

razones,Era un empleo temporal,Razones de la demanda,Razones económicas/ bajos ingresos,Razones personales,Renuncio
dependencia,,,,,
Hasta dos,20,62,59,56,28
Mas de dos,8,33,22,25,15
Nadie,19,47,41,63,31